## INSTRUCTIONS
- You have 50 minutes to complete the below exercise
- Run the cells in order to verify the output
- Download locally the notebook (click on File-Download) and send it to giando.palumbo2@gmail.com

In [24]:
import numpy as np
import pandas as pd

url = 'https://raw.githubusercontent.com/pal-dev-labs/Python-for-Economic-Applications/main/Data/titanic.csv'  

titanic_data = pd.read_csv(url)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# print the table info

In [15]:
# print the column of the names of the Passengers

In [18]:
# print a subtable that contain only the names of the passengers, the ages and the tickets

In [ ]:
# for the above table, print only the the rows from 500 to 600

In [ ]:
# drop all NaN from the table

In [21]:
# extract from the table all the information for passangers with age > 30

In [ ]:
# extract from the table all the information for passangers with age > 30 and female

In [23]:
# extract the columns of age and fare and transform it in a new numpy matrix (you can use the method df[].value)

In [25]:
# extract the rows from 100 to 200 with NUMPY slicing notation

In [ ]:
# extract the last 10 rows with NUMPY slicing notation

In [26]:
# put values 0 in the rows from 100 to 200

In [27]:
# extract the first column from the matrix and calculate the average

# More difficult

In [ ]:
# sort the titanic table using the NAME of passengers (from A to Z)